{
    "reviews": [
        {
            "name": "Keith Farrelle Cozart",
            "date": "11-24-2022",
            "comment": "A trip of a lifetime! Christmas Island Expeditions exceeded all expectations. The Red Crab Migration was a sight to behold, and snorkeling in the crystal-clear waters was unforgettable. The team's commitment to sustainability and conservation is truly commendable. Can't wait to return!",
            "rating": 5
        },
        {
            "name": "Hilarie Climtom",
            "date": "04-05-2022",
            "comment": "I've traveled to many places around the world, but Christmas Island is truly special. Thanks to Christmas Island Expeditions, I was able to explore its hidden gems and learn about its rich history and wildlife. Who knew there could be so many red crabs scurrying over my feet. The team's passion for the island is infectious, and I left feeling inspired and rejuvenated.",
            "rating": 5
        },
        {
            "name": "Elena Pinto",
            "date": "11-09-2019",
            "comment": "I picked up one million shiny rocks and I got sand in my bedsheets. Awesome.",
            "rating": 5
        },
		{
            "name": "Tom",
            "date": "03-10-2020",
            "comment": "Amazing. I felt so detached from the world in such a special way. I did not look at my phone or the news once while I was there. Oh well, back to boring normal for me, I guess. Le-sigh",
            "rating": 5
        },
        {
            "name": "Sandra",
            "date": "07-12-2022",
            "comment": "Absolutely amazing experience with Christmas Island Expeditions! From the moment we arrived, everything was perfect and hospitable. The tour guides were very friendly and tried their hardest to give every member of their tour a personal experience, myself included. The accommodations were top-notch, and the island itself is like paradise on Earth. I wish I could bring a piece of it home with me... I will be returning again and again!",
            "rating": 5
        },
        {
            "name": "Anonymous",
            "date": "02-28-2023",
            "comment": "Christmas Island Expeditions provided the perfect blend of adventure and relaxation. The bird life is spectacular, and the sunset views are breathtaking. The accommodations were luxurious, and the food was delicious. A truly unforgettable experience that I would recommend to anyone looking for a unique and memorable vacation.",
            "rating": 5
        },
		{
            "name": "Charlotte",
            "date": "05-19-2021",
            "comment": "I cannot recommend this island or this travel company enough. Seriously. All my friends know how much I adore this company.",
            "rating": 5
        },
        {
            "name": "Jonatan Håstad",
            "date": "03-19-2042",
            "comment": "Some memories come and go. But I know my memories of Christmas Island will stay. The tour was well-planned, and the guides were knowledgeable. However, I wish there had been more options for dining and activities in the evenings. Overall, a great experience!",
            "rating": 4
        },
        {
            "name": "Bogos Binted",
            "date": "12-21-2112",
            "comment": "👽",
            "rating": 4
        },
        {
            "name": "Benjamin Reichwald",
            "date": "04-09-2022",
            "comment": "Christmas Island is a paradise for nature lovers, lovers, and myself. Christmas Island Expeditions provides an opportunity to experience its wonders. The tour was organized, and the guides were there. My only complaint is that some of the activities were weather-dependent, so it would have been nice to have options especially during thunderstorms.",
            "rating": 4
        },
        {
            "name": "Anonymous",
            "date": "06-30-2022",
            "comment": "I had high hopes for my trip with Christmas Island Expeditions, but it fell a bit short of my expectations. While the island itself is beautiful, I felt that the tour lacked depth. The guides were friendly, but I would have liked more information about the island's history and culture. Overall, a decent experience.",
            "rating": 3
        },
        {
            "name": "Anonymous",
            "date": "11-08-2022",
            "comment": "I had a decent experience with Christmas Island Expeditions. The tour was well-organized, and the guides were friendly. However, I felt that the itinerary was a bit too rigid, and there was limited flexibility to explore on my own. The accommodations were comfortable but not luxurious. Overall, an average trip.",
            "rating": 3
        },
        {
            "name": "Baby",
            "date": "02-29-2024",
            "comment": "djofjlinnaabuwiurp 32wqnqwr oiff",
            "rating": 3
        },
        {
            "name": "Anonymous",
            "date": "03-14-2022",
            "comment": "Christmas Island Expeditions failed to meet my expectations in many many aspects. Aside from the tour being rushed, the food was mediocre. Omelettes every morning! Have some variety! I would recommend looking for other tour companies for a better experience.",
            "rating": 2
        },
        {
            "name": "Scoobert Doobert",
            "date": "09-13-1969",
            "comment": "I wanted to go to Spooky Island but everybody else said no. Not enough clues or mysteries.",
            "rating": 1
        },
        {
            "name": "Hubert",
            "date": "09-22-2022",
            "comment": "Would put 0 stars if I could. We did not see a single red crab.",
            "rating": 1
        },
        {
            "name": "Anonymous",
            "date": "07-12-2022",
            "comment": "Do not book with Christmas Island Expeditions! They are a scam. The tour was nothing like what was advertised. We did not get to snorkel at all; they made us stay on the boat. The tour guides were incredibly unprofessional!!!!!!! One of them tried to run off with my wife. Save yourself the trouble and book with a reputable company instead.",
            "rating": 1
        }
    ]
}